[
    {
      "product_uid": "111118",
      "product_name": "T-Fal Total Non-Stick 8-qt. Stock Pot, Black",
      "product_description": "8-quart stock pot made of heavy gauge aluminum for excellent heat conduction. Durable non-stick coating on the interior and exterior for quick clean up. Ergonomic, stay-cool silicone handles; glass lid with vent hole.
  Non-stick inside and out for easy cooking and clean up
  Even heat base delivers even heat distribution for reliable cooking results
  Vented glass lid maximizes visibility for optimum cooking control
  Soft touch handles for comfort gripping
  Dishwasher safe
  Oven safe up to 350 F",
      "product_image_url": "https://images.thdstatic.com/productImages/a41e2ef9-feec-47ab-93b2-976e347e11de/svn/cook-n-home-stock-pots-02747-64_1000.jpg",
      "product_image_visual_description": null,
      "search_relevance_score": 0.8,
      "reason_for_recommendaion": "This product is a stock pot designed for cooking, making it relevant to the search term 'something for cooking'.",
      "related_items": []
    },
    {
      "product_uid": "180166",
      "product_name": "Toledo Fine Locks Segovia Antique Brass Keyed Entry Lever Lockset",
      "product_description": "Toledo and Co. offers our customers superior quality locks made by strict specifications to ensure an outstanding security. Toledo Fine Locks is a combination of the latest technology and a traditional craftsmanship with a lifetime warranty. For added security, the entry lock set features an anti-bump key cylinder system. Toledo Fine Locks is perfect for designers and homeowners looking for alternatives that provide distinguished quality, high security, beautiful designs and fine finishes. The Antique Brass Keyed Entry Lever is a perfect blend of timeless design and classic finish. Change your home appearance with this exceptional option.
  Fits 1-3/8 in. to 1-3/4 in. doors
  Adjustable backset
  Lever-styled lockset is reversible
  Antique brass finish complements most home decor
  Meets or surpasses ANSI grade 3 standards for strength and security
  ADA compliant
  For residential use",
      "product_image_url": "https://toledolocks.com/cdn/shop/products/V1900-SE-US3_3e1d4d83-3ec5-4646-b7c9-0b698f575113_800x.png?v=1611925506",
      "product_image_visual_description": null,
      "search_relevance_score": 0.1,
      "reason_for_recommendaion": "This product is a lockset, which is not directly related to cooking. However, it is possible to use a lockset to secure a kitchen cabinet or pantry where cooking supplies are stored, making it somewhat relevant to the search term 'something for cooking'.",
      "related_items": []
    }
  ]